//
//  News.swift
//  Naviganion
//
//  Created by Daniil Ivanov on 19.04.2022.
//

import Foundation

var newsArticles: [News] = [
    News(author: "The Last of Us: Remastered",
         description: "Это переиздание лучшей игры 2013 для PlayStation 3 — The Last of Us, которое будет иметь более большее разрешение 1080p, модели более высокого разрешения, новые тени и освещение, обновленные текстуры и множество других улучшений. Сюжет игры отправит вас в пост-апокалиптический зараженный мир, где люди превращаются в зомби-мутантов, но не они ваш главный враг, а выжившие люди. В обновленную версии для PS4 также войдут внутриигровое видео с комментариями от Нила Дракманна (сценарист, арт-директор игры) и тонна дополнительного контента из The Last of Us.",
         image: "1",
         likes: 1921,
         views: 2000),
    News(author: "Uncharted 4: A Thief’s End",
         description: "Uncharted 4: A Thief’s End — это новая, четвертая часть популярного приключенческого экшена о Нейтане Дрейке, которая разрабатывается для PlayStation 4.Натан Дрейк возвращается с обновленной графикой, 1080p разрешением и совершенно новой историей. Благодаря мощи системы нового поколения PS4, модель Дрейка в Uncharted 4 намного превосходит модели из PS3-версий серии и имеет в два раза больше полигонов. На этот раз, Дрейк должен отыскать легендарное пиратское сокровище. Опасное путешествие подвергнет героя не только суровому физическому испытанию, но заставит его пожертвовать многим, чтобы спасти тех, кем он дорожит. Натан Дрейк нового поколения будет более реалистичен. Он вынужден будет вернуться в оставленный мир воров, отправившись в свое величайшее приключение, проверяя свои физические возможности и решимость. Он проверит себя, на что готов и чем готов пожертвовать, чтобы сохранить тех, кого он любит.",
         image: "2",
         likes: 4626,
         views: 20003),
    News(author: "God of War (2018)",
         description: "God of War для PS4 — это перезапуск легендарной брутальной франшизы от Sony Santa Monica, который расскажет совершенно новую эмоциональную историю о путешествии Кратоса и даст игрокам переосмысленный геймплей с видом от третьего лица. Вы станете свидетелями убедительной драмы, которая разворачивается, когда бессмертные полубоги принимают решения о своей перемене. Кратос решил измениться раз и навсегда, разорвать порочный круг бессмысленного насилия, который увековечил его падшую семью Олимпа. Теперь все былое в прошлом — злополучный контракт с Аресом, убийство его семьи и безумная ярость спровоцированная местью, которая в конечном итоге закончилась эпическим разрушением Олимпа. Теперь у Кратоса есть маленький сын за которого он несет ответственно и он обязан усмирить того монстра, который в нем живет и вырывается благодаря его ярости…",
         image: "3",
         likes: 4625,
         views: 66388),
    News(author: "The Witcher 3: Wild Hunt",
         description: "The Witcher 3: Wild Hunt (Ведьмак 3: Дикая Охота) — новая часть в знаменитой серии от Польской студии CD Projekt RED, которая будет сочетать в себе фирменный  нелинейный сюжет и открытый разнообразный мир, который будет больше, чем любой другой в современной РПГ в купе с современной графикой. А общая площадь мира игры в тридцать раз больше, чем мир предыдущей части серии. В Ведьмаке 3 вас ждет полностью открытый мир для исследования, без каких-либо искусственных границ и ограничений для его покорения. Для передвижения по этому многогранному и разнообразному миру можно будет использовать различный транспорт, например лошадей или корабли. Сюжетная линия Wild Hunt продолжает историю Геральта из Ривии, ведьмака и охотника на монстров. В центре сюжета будет новое вторжение Нильфгаарда, а также поиски потерянной возлюбленной и конфликт с Дикой Охотой. Сюжет больше не будет делиться на разнообразные главы, что стало осуществимым благодаря движку нового поколения REDengine 3. А решения принятые по мере прохождения сюжетной компании будут влечь за собой более внушительные последствия, чем в предыдущих частях.",
         image: "4",
         likes: 13332,
         views: 23334),
]
